var no = new Array(
"1","2","3","4","5","6","7","8","9","10","11"
);

var le = new Array(
"1","1","1","2","2","2","2","2","3","3","3"
);

var ti = new Array(
"ダイオード","コンデンサ","色","魚","エジソン","メイ","サボる","2＾x","二進数","光速","キバン"
);

var na = new Array(
"最初に発光ダイオードが発明された年の、何年後に青色が発明されたか？",
"「104」と書かれた積層セラミックコンデンサがある。この容量を答えよ。",
"Webの世界では色を6桁の数で表します。では、一般的な「赤」はどう表すでしょう？",
"デンキウナギとデンキナマズ、発電力がつよいのはどっち？",
"発明王、エジソンが生涯に取得した特許の数に一番近いのは？",
"ポルトガル語で、「メイ」は11月という意味である。○か×か？",
"「サボる」の語源は何語か？",
"2^xが初めて1000を超えるときのxの値は？",
"二進数で「十」を表すとき、正しいのはどっち？",
"光速は何m/s？",
"回路きばんの工場で働く。正しいのはどっち？"
);

var s1 = new Array(
"31年後","1000000pF（ピコファラド）","#00BFFF","デンキウナギ","500","○","英語",
"10","1011","299792458 m/s","基板"
);

var s2 = new Array(
"21年後","0.1μF（マイクロファラド）","#FF0000","デンキナマズ","1500","×","フランス語",
"11","1010","2997924587 m/s","基盤"
);

var co = new Array(
"2","2","2","1","2","2","2","1","2","1","1"
	)