// 番号
var no = new Array(
  "1","2","3","4","5","6","7","8","9","10","11","12","13","14","15","16","17","18","19","20"
);

// 難易度
var le = new Array(
  "1",                           // No.1
  "1",                           // No.2
  "1",                           // No.3
  "2",                           // No.4
  "2",                           // No.5
  "2",                           // No.6
  "2",                           // No.7
  "2",                           // No.8
  "3",                           // No.9
  "3",                           // No.10
  "3",                           // No.11
  "2",                           // No.12
  "1",                           // No.13
  "3",                           // No.14
  "3",                           // No.15
  "2",                           // No.16
  "1",                           // No.17
  "3",                           // No.18
  "2",                           // No.19
  "3"                            // No.20
);

// タイトル
var ti = new Array(
  "ダイオード",                  // No.1
  "コンデンサ",                  // No.2
  "色",                          // No.3
  "魚",                          // No.4
  "エジソン",                    // No.5
  "メイ",                        // No.6
  "サボる",                      // No.7
  "2＾x",                        // No.8
  "二進数",                      // No.9
  "光速",                        // No.10
  "キバン",                      // No.11
  "ようかいのせいなのね",        // No.12
  "SNS",                         // No.13
  "違法コピー",                  // No.14
  "電気回路",                    // No.15
  "1E",                          // No.16
  "漢字",                        // No.17
  "物理",                        // No.18
  "お菓子",                      // No.19
  "ゲーム"                       // No.20
);

// 問題
var na = new Array(
  "最初に発光ダイオードが発明された年の、何年後に青色が発明されたか？",            // No.1
  "「104」と書かれた積層セラミックコンデンサがある。この容量を答えよ。",           // No.2
  "Webの世界では色を6桁の数で表します。では、一般的な「赤」はどう表すでしょう？",  // No.3
  "デンキウナギとデンキナマズ、発電力がつよいのはどっち？",                        // No.4
  "発明王、エジソンが生涯に取得した特許の数に一番近いのは？",                      // No.5
  "ポルトガル語で、「メイ」は11月という意味である。○か×か？",                    // No.6
  "「サボる」の語源は何語か？",                                                    // No.7
  "2^xが初めて1000を超えるときのxの値は？",                                        // No.8
  "二進数で「十」を表すとき、正しいのはどっち？",                                  // No.9
  "光速は何m/s？",                                                                 // No.10
  "回路きばんの工場で働く。正しいのはどっち？",                                    // No.11
  "カマイタチは、1匹目が目を潰し2匹目が体を切る。では3匹目は何をするか。",         // No.12
  "人気のSNSはどっち？",                                                           // No.13
  "違法コピーに対する刑罰に、懲役は含まれる？ ○か×か。",                         // No.14
  "あらゆる回路には論理ゲートという論理演算を行う電気回路及び電気回路が使われています。ここで問題、2つのボタンがあるとします。そのうち、片方だけを押すと電気がつくが、両方がon、offの状態では電気がつきません。その論理ゲートはどちらですか。", // No.15
  "1Eの人で、普段メガネをかけている人の割合は？（コンタクトレンズを除く）",        // No.16
  "「土竜」の読み方は？",                                                          // No.17
  "次のうち、スカラーはどちらか。",                                                // No.18
  "グリコ ポッキーチョコレートの原材料で、一番最初に書かれているのはなにか？",     // No.19
  "ベラべオーグ降臨のバトル目に登場するモンスターは冥界神・ハーデスである"         // No.20
);

// 選択肢1
var s1 = new Array(
  "31年後",                     // No.1
  "1000000pF（ピコファラド）",  // No.2
  "#00BFFF",                    // No.3
  "デンキウナギ",               // No.4
  "500",                        // No.5
  "○",                         // No.6
  "英語",                       // No.7
  "10",                         // No.8
  "1011",                       // No.9
  "299792458 m/s",              // No.10
  "基板",                       // No.11
  "痛みがなくなり血が止まる薬を塗る", // No.12
  "Twiter",                     // No.13
  "○",                         // No.14
  "OR（オア）ゲート",           // No.15
  "約30％",                     // No.16
  "もぐら",                     // No.17
  "速さ",                       // No.18
  "砂糖",                       // No.19
  "そうだよ"                    // No.20
);

// 選択肢2
var s2 = new Array(
  "21年後",                      // No.1
  "0.1μF（マイクロファラド）",  // No.2
  "#FF0000",                     // No.3
  "デンキナマズ",                // No.4
  "1500",                        // No.5
  "×",                          // No.6
  "フランス語",                  // No.7
  "11",                          // No.8
  "1010",                        // No.9
  "2997924587 m/s",              // No.10
  "基盤",                        // No.11
  "足をかる",                    // No.12
  "Twitter",                     // No.13
  "×",                          // No.14
  "XOR（エクスクルーシブル・オア）ゲート", // No.15
  "約10％",                      // No.16
  "みみず",                      // No.17
  "速度",                        // No.18
  "小麦粉",                      // No.19
  "そうじゃないよ"               // No.20
);

// 答え
var co = new Array(
  "2",                           // No.1
  "2",                           // No.2
  "2",                           // No.3
  "1",                           // No.4
  "2",                           // No.5
  "2",                           // No.6
  "2",                           // No.7
  "1",                           // No.8
  "2",                           // No.9
  "1",                           // No.10
  "1",                           // No.11
  "1",                           // No.12
  "2",                           // No.13
  "1",                           // No.14
  "2",                           // No.15
  "1",                           // No.16
  "1",                           // No.17
  "1",                           // No.18
  "2",                           // No.19
  "2"                            // No.20
);

function test(){
  a=0;
  switch (document.selbox.level.selectedIndex){
    case 0:
    case 1: a = Math.floor( Math.random()*3);     break;
    case 2: a = 3 +Math.floor( Math.random()*9);  break;
    case 3: a = 9 +Math.floor( Math.random()*2);  break;
    case 4: a = Math.floor( Math.random()*20);    break;
    // `random()*11`の11は問題数
  }

  document.getElementById("ti").innerHTML=ti[a];
  document.getElementById("na").innerHTML=na[a];
  document.getElementById("s1").innerHTML=s1[a];
  document.getElementById("s2").innerHTML=s2[a];
  Array(le[a]).join("★");
  document.getElementById("le").innerHTML="難易度:"+le[a];
}

function replyclick1(){
  if(co[a]==1)
    alert("1の扉へお進みください");
  if(co[a]==2)
    alert("2の扉へお進みください");
}

function replyclick(){
  if(co[a]==2)
    alert("1の扉へお進みください");
  if(co[a]==1)
    alert("2の扉へお進みください");
}

// 隠しコマンド
function pero(){
  alert("ハイという素直なこころ");
}

function ring() {
   document.getElementById("JonesSound").play();
}